wrk/output/stage_6/3_get_full_wrk.txt
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 1539.919ms, rate sampling interval: 5099ms
  Thread calibration: mean lat.: 1620.463ms, rate sampling interval: 5361ms
  Thread calibration: mean lat.: 1582.684ms, rate sampling interval: 5328ms
  Thread calibration: mean lat.: 1601.005ms, rate sampling interval: 5275ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.04s     1.68s    7.79s    50.24%
    Req/Sec   186.08     23.40   217.00     41.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.22s 
 75.000%    6.66s 
 90.000%    7.11s 
 99.000%    7.68s 
 99.900%    7.75s 
 99.990%    7.79s 
 99.999%    7.79s 
100.000%    7.79s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2603.007     0.000000            1         1.00
    2846.719     0.100000         1542         1.11
    2961.407     0.200000         3023         1.25
    3450.879     0.300000         4533         1.43
    4481.023     0.400000         6040         1.67
    5218.303     0.500000         7553         2.00
    5578.751     0.550000         8306         2.22
    5832.703     0.600000         9060         2.50
    6295.551     0.650000         9808         2.86
    6537.215     0.700000        10566         3.33
    6668.287     0.750000        11347         4.00
    6721.535     0.775000        11747         4.44
    6787.071     0.800000        12077         5.00
    6836.223     0.825000        12475         5.71
    6873.087     0.850000        12863         6.67
    6938.623     0.875000        13204         8.00
    7016.447     0.887500        13394         8.89
    7114.751     0.900000        13583        10.00
    7200.767     0.912500        13768        11.43
    7294.975     0.925000        13983        13.33
    7368.703     0.937500        14146        16.00
    7426.047     0.943750        14240        17.78
    7475.199     0.950000        14337        20.00
    7499.775     0.956250        14436        22.86
    7548.927     0.962500        14524        26.67
    7589.887     0.968750        14620        32.00
    7610.367     0.971875        14680        35.56
    7626.751     0.975000        14726        40.00
    7639.039     0.978125        14773        45.71
    7647.231     0.981250        14815        53.33
    7659.519     0.984375        14873        64.00
    7663.615     0.985938        14884        71.11
    7667.711     0.987500        14904        80.00
    7675.903     0.989062        14922        91.43
    7684.095     0.990625        14946       106.67
    7688.191     0.992188        14971       128.00
    7692.287     0.992969        14991       142.22
    7696.383     0.993750        15001       160.00
    7708.671     0.994531        15005       182.86
    7720.959     0.995313        15020       213.33
    7725.055     0.996094        15031       256.00
    7733.247     0.996484        15037       284.44
    7737.343     0.996875        15049       320.00
    7737.343     0.997266        15049       365.71
    7741.439     0.997656        15062       426.67
    7741.439     0.998047        15062       512.00
    7741.439     0.998242        15062       568.89
    7745.535     0.998437        15069       640.00
    7745.535     0.998633        15069       731.43
    7749.631     0.998828        15073       853.33
    7749.631     0.999023        15073      1024.00
    7753.727     0.999121        15075      1137.78
    7778.303     0.999219        15076      1280.00
    7786.495     0.999316        15080      1462.86
    7786.495     0.999414        15080      1706.67
    7786.495     0.999512        15080      2048.00
    7790.591     0.999561        15085      2275.56
    7790.591     0.999609        15085      2560.00
    7790.591     0.999658        15085      2925.71
    7790.591     0.999707        15085      3413.33
    7790.591     0.999756        15085      4096.00
    7790.591     0.999780        15085      4551.11
    7790.591     0.999805        15085      5120.00
    7790.591     0.999829        15085      5851.43
    7790.591     0.999854        15085      6826.67
    7794.687     0.999878        15087      8192.00
    7794.687     1.000000        15087          inf
#[Mean    =     5043.602, StdDeviation   =     1682.942]
#[Max     =     7790.592, Total count    =        15087]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  22384 requests in 30.00s, 1.50MB read
  Non-2xx or 3xx responses: 3901
Requests/sec:    746.09
Transfer/sec:     51.33KB