wrk/output/stage_6/4_delete_wrk.txt
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 193.823ms, rate sampling interval: 675ms
  Thread calibration: mean lat.: 300.209ms, rate sampling interval: 925ms
  Thread calibration: mean lat.: 294.158ms, rate sampling interval: 1045ms
  Thread calibration: mean lat.: 194.932ms, rate sampling interval: 684ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.18s   541.58ms   2.93s    71.62%
    Req/Sec   222.92     29.36   275.00     60.20%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.06s 
 75.000%    1.35s 
 90.000%    2.05s 
 99.000%    2.72s 
 99.900%    2.90s 
 99.990%    2.92s 
 99.999%    2.93s 
100.000%    2.93s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     322.303     0.000000            1         1.00
     605.695     0.100000         1779         1.11
     734.207     0.200000         3556         1.25
     841.727     0.300000         5323         1.43
     957.439     0.400000         7113         1.67
    1058.815     0.500000         8893         2.00
    1122.303     0.550000         9762         2.22
    1217.535     0.600000        10649         2.50
    1257.471     0.650000        11534         2.86
    1300.479     0.700000        12432         3.33
    1349.631     0.750000        13321         4.00
    1373.183     0.775000        13751         4.44
    1441.791     0.800000        14196         5.00
    1625.087     0.825000        14639         5.71
    1741.823     0.850000        15084         6.67
    1930.239     0.875000        15528         8.00
    1974.271     0.887500        15751         8.89
    2054.143     0.900000        15969        10.00
    2134.015     0.912500        16192        11.43
    2177.023     0.925000        16416        13.33
    2246.655     0.937500        16635        16.00
    2295.807     0.943750        16748        17.78
    2347.007     0.950000        16856        20.00
    2435.071     0.956250        16974        22.86
    2465.791     0.962500        17081        26.67
    2516.991     0.968750        17190        32.00
    2543.615     0.971875        17245        35.56
    2580.479     0.975000        17301        40.00
    2615.295     0.978125        17357        45.71
    2656.255     0.981250        17416        53.33
    2678.783     0.984375        17467        64.00
    2695.167     0.985938        17496        71.11
    2701.311     0.987500        17523        80.00
    2707.455     0.989062        17551        91.43
    2734.079     0.990625        17585       106.67
    2740.223     0.992188        17605       128.00
    2766.847     0.992969        17621       142.22
    2789.375     0.993750        17634       160.00
    2811.903     0.994531        17647       182.86
    2834.431     0.995313        17660       213.33
    2856.959     0.996094        17677       256.00
    2863.103     0.996484        17681       284.44
    2871.295     0.996875        17694       320.00
    2873.343     0.997266        17700       365.71
    2875.391     0.997656        17702       426.67
    2879.487     0.998047        17709       512.00
    2885.631     0.998242        17713       568.89
    2887.679     0.998437        17716       640.00
    2893.823     0.998633        17719       731.43
    2895.871     0.998828        17723       853.33
    2897.919     0.999023        17731      1024.00
    2897.919     0.999121        17731      1137.78
    2897.919     0.999219        17731      1280.00
    2897.919     0.999316        17731      1462.86
    2902.015     0.999414        17734      1706.67
    2904.063     0.999512        17735      2048.00
    2906.111     0.999561        17736      2275.56
    2908.159     0.999609        17738      2560.00
    2908.159     0.999658        17738      2925.71
    2908.159     0.999707        17738      3413.33
    2918.399     0.999756        17740      4096.00
    2918.399     0.999780        17740      4551.11
    2918.399     0.999805        17740      5120.00
    2918.399     0.999829        17740      5851.43
    2922.495     0.999854        17741      6826.67
    2922.495     0.999878        17741      8192.00
    2930.687     0.999890        17742      9102.22
    2930.687     0.999902        17742     10240.00
    2930.687     0.999915        17742     11702.86
    2930.687     0.999927        17742     13653.33
    2930.687     0.999939        17742     16384.00
    2934.783     0.999945        17743     18204.44
    2934.783     1.000000        17743          inf
#[Mean    =     1175.593, StdDeviation   =      541.579]
#[Max     =     2932.736, Total count    =        17743]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  27277 requests in 30.00s, 1.77MB read
Requests/sec:    909.11
Transfer/sec:     60.37KB