wrk/output/stage_6/4_delete_wrk.txt
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 5.603ms, rate sampling interval: 28ms
  Thread calibration: mean lat.: 6.271ms, rate sampling interval: 32ms
  Thread calibration: mean lat.: 6.182ms, rate sampling interval: 33ms
  Thread calibration: mean lat.: 4.612ms, rate sampling interval: 22ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.59ms    1.98ms  24.48ms   91.58%
    Req/Sec   254.41     29.25   476.00     76.47%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.06ms
 75.000%    2.47ms
 90.000%    3.89ms
 99.000%   11.72ms
 99.900%   18.22ms
 99.990%   23.47ms
 99.999%   24.50ms
100.000%   24.50ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.912     0.000000            1         1.00
       1.474     0.100000         2013         1.11
       1.647     0.200000         4013         1.25
       1.790     0.300000         6007         1.43
       1.926     0.400000         8003         1.67
       2.055     0.500000        10000         2.00
       2.121     0.550000        11005         2.22
       2.193     0.600000        11998         2.50
       2.273     0.650000        13000         2.86
       2.363     0.700000        14005         3.33
       2.471     0.750000        15000         4.00
       2.553     0.775000        15495         4.44
       2.647     0.800000        16002         5.00
       2.779     0.825000        16500         5.71
       2.977     0.850000        16999         6.67
       3.297     0.875000        17494         8.00
       3.571     0.887500        17745         8.89
       3.895     0.900000        17993        10.00
       4.423     0.912500        18244        11.43
       5.071     0.925000        18493        13.33
       5.759     0.937500        18747        16.00
       6.167     0.943750        18871        17.78
       6.567     0.950000        18993        20.00
       7.135     0.956250        19118        22.86
       7.655     0.962500        19244        26.67
       8.383     0.968750        19369        32.00
       8.735     0.971875        19430        35.56
       9.191     0.975000        19496        40.00
       9.607     0.978125        19556        45.71
      10.087     0.981250        19618        53.33
      10.655     0.984375        19680        64.00
      10.943     0.985938        19711        71.11
      11.231     0.987500        19743        80.00
      11.503     0.989062        19774        91.43
      11.927     0.990625        19805       106.67
      12.391     0.992188        19836       128.00
      12.615     0.992969        19853       142.22
      12.975     0.993750        19868       160.00
      13.183     0.994531        19883       182.86
      13.687     0.995313        19899       213.33
      14.199     0.996094        19914       256.00
      14.791     0.996484        19922       284.44
      14.983     0.996875        19930       320.00
      15.415     0.997266        19938       365.71
      15.775     0.997656        19946       426.67
      16.703     0.998047        19954       512.00
      16.815     0.998242        19957       568.89
      17.119     0.998437        19961       640.00
      17.647     0.998633        19965       731.43
      17.951     0.998828        19969       853.33
      18.287     0.999023        19973      1024.00
      18.799     0.999121        19975      1137.78
      19.311     0.999219        19977      1280.00
      19.791     0.999316        19980      1462.86
      20.143     0.999414        19981      1706.67
      20.367     0.999512        19983      2048.00
      20.927     0.999561        19984      2275.56
      21.167     0.999609        19985      2560.00
      21.615     0.999658        19986      2925.71
      21.743     0.999707        19987      3413.33
      22.543     0.999756        19988      4096.00
      22.543     0.999780        19988      4551.11
      22.847     0.999805        19989      5120.00
      22.847     0.999829        19989      5851.43
      23.471     0.999854        19990      6826.67
      23.471     0.999878        19990      8192.00
      23.471     0.999890        19990      9102.22
      24.255     0.999902        19991     10240.00
      24.255     0.999915        19991     11702.86
      24.255     0.999927        19991     13653.33
      24.255     0.999939        19991     16384.00
      24.255     0.999945        19991     18204.44
      24.495     0.999951        19992     20480.00
      24.495     1.000000        19992          inf
#[Mean    =        2.590, StdDeviation   =        1.983]
#[Max     =       24.480, Total count    =        19992]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30000 requests in 30.00s, 1.95MB read
Requests/sec:   1000.12
Transfer/sec:     66.41KB